; domain
(define
	(domain travellingsalesmanbasic)
	(:requirements :strips :typing)
	(:types
		city
	)
	(:predicates
		(connected ?city1 - city ?city2 - city)
		(current ?city - city)
		(visited ?city - city)
	)
	(:action move
		:parameters (?from- - city ?to - city)
		:precondition (and (current ?from-) (connected ?from- ?to) (not (visited ?to)))
		:effect (and (not (current ?from-)) (current ?to) (visited ?to))
	)
)

; problem
(define
	(problem travellingsalesmanbasic)
	(:domain travellingsalesmanbasic)
	(:objects
		TM HD AB SB CJ BH MM - city
	)
	(:init (current TM) (visited TM) (connected TM HD) (connected HD TM) (connected TM BH) (connected BH TM) (connected HD AB) (connected AB HD) (connected AB SB) (connected SB AB) (connected AB CJ) (connected CJ AB) (connected CJ BH) (connected BH CJ) (connected CJ MM) (connected MM CJ) (connected BH MM) (connected MM BH) (connected SB CJ) (connected CJ SB))
	(:goal (and (visited TM) (visited HD) (visited AB) (visited SB) (visited CJ) (visited BH) (visited MM)))
)

; plan
1. (move tm bh)
   deleted: (current tm)
   added: (current bh) (visited bh)
   goals met: 2 of 7
2. (move bh mm)
   deleted: (current bh)
   added: (current mm) (visited mm)
   goals met: 3 of 7
3. (move mm cj)
   deleted: (current mm)
   added: (current cj) (visited cj)
   goals met: 4 of 7
4. (move cj sb)
   deleted: (current cj)
   added: (current sb) (visited sb)
   goals met: 5 of 7
5. (move sb ab)
   deleted: (current sb)
   added: (current ab) (visited ab)
   goals met: 6 of 7
6. (move ab hd)
   deleted: (current ab)
   added: (current hd) (visited hd)
   goals met: 7 of 7
